using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace HomeWork3
{
	class Program
	{
		static void Main(string[] args)
		{
			/*1. 
				а)Дописать структуру Complex, добавив метод вычисления чисел. Продемонстрировать работу структуры.
				б)Дописать класс Complex, добавив методы вычитания и произведения чисел. Проверить работу класса.
				в)Добавить диолог с использованием Switch демонстрирующий работу класса.
			 */



			/*2. 
				С клавиатуры вводятся числа, пока не будет введен 0 (Каждое число в новой строке).
				Требуется подсчитать сумму всех нечётных положительных чисел. 
			Сами числа и суммы вывести на экран, использую tryParse.
			 */


			/*3.
				Описать класс дробей - рациональных чисел, являющихся отношением двух целых чисел.
				Предусмотреть методы сложения, вычитания, умножения и деления дробей. 
				Написать программу, демонстрирующую все разработанные элементы класса
				
			 
			 */











		}
	}
}
